In [2]:
import pandas as pd
df = pd.read_csv("D:\codes\dsbda_final/adult.csv")

In [3]:
print(df)

       age     workclass  fnlwgt     education  educational-num  \
0       25       Private  226802          11th                7
1       38       Private   89814       HS-grad                9
2       28     Local-gov  336951    Assoc-acdm               12
3       44       Private  160323  Some-college               10
4       18             ?  103497  Some-college               10
...    ...           ...     ...           ...              ...
48837   27       Private  257302    Assoc-acdm               12
48838   40       Private  154374       HS-grad                9
48839   58       Private  151910       HS-grad                9
48840   22       Private  201490       HS-grad                9
48841   52  Self-emp-inc  287927       HS-grad                9

           marital-status         occupation relationship   race  gender  \
0           Never-married  Machine-op-inspct    Own-child  Black    Male
1      Married-civ-spouse    Farming-fishing      Husband  White    Male
2      Married-civ-spouse    Protective-serv      Husband  White    Male
3      Married-civ-spouse  Machine-op-inspct      Husband  Black    Male
4           Never-married                  ?    Own-child  White  Female
...                   ...                ...          ...    ...     ...
48837  Married-civ-spouse       Tech-support         Wife  White  Female
48838  Married-civ-spouse  Machine-op-inspct      Husband  White    Male
48839             Widowed       Adm-clerical    Unmarried  White  Female
48840       Never-married       Adm-clerical    Own-child  White    Male
48841  Married-civ-spouse    Exec-managerial         Wife  White  Female

       capital-gain  capital-loss  hours-per-week native-country income
0                 0             0              40  United-States  <=50K
1                 0             0              50  United-States  <=50K
2                 0             0              40  United-States   >50K
3              7688             0              40  United-States   >50K
4                 0             0              30  United-States  <=50K
...             ...           ...             ...            ...    ...
48837             0             0              38  United-States  <=50K
48838             0             0              40  United-States   >50K
48839             0             0              40  United-States  <=50K
48840             0             0              20  United-States  <=50K
48841         15024             0              40  United-States   >50K

[48842 rows x 15 columns]

In [4]:
df

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [5]:
df.groupby("gender")["age"].describe()

          count       mean        std   min   25%   50%   75%   max
gender
Female  16192.0  36.927989  14.137423  17.0  25.0  35.0  46.0  90.0
Male    32650.0  39.494395  13.412850  17.0  29.0  38.0  48.0  90.0

In [3]:
numerical_df = df.select_dtypes(include='number')

# Aggregate using sum, min, and max
aggregated_results = numerical_df.agg(['sum', 'min', 'max'])

# Display the aggregated results
print(aggregated_results)

         age      fnlwgt  educational-num  capital-gain  capital-loss  \
sum  1887430  9263575662           492234      52703821       4273788
min       17       12285                1             0             0
max       90     1490400               16         99999          4356

     hours-per-week
sum         1974310
min               1
max              99

In [8]:
x = df['age'].min()
x

17

In [9]:
df.groupby("income")["age"].mean()

income
<=50K    36.872184
>50K     44.275178
Name: age, dtype: float64

In [10]:
df.groupby("marital-status")["age"].median()

marital-status
Divorced                 42.0
Married-AF-spouse        30.0
Married-civ-spouse       42.0
Married-spouse-absent    40.0
Never-married            25.0
Separated                39.0
Widowed                  60.0
Name: age, dtype: float64

In [11]:
df.groupby(["gender","marital-status"])["age"].std()

gender  marital-status
Female  Divorced                 10.794868
        Married-AF-spouse        12.342744
        Married-civ-spouse       11.402805
        Married-spouse-absent    13.019854
        Never-married            10.231671
        Separated                10.757639
        Widowed                  11.657268
Male    Divorced                 10.161659
        Married-AF-spouse         6.336522
        Married-civ-spouse       12.080786
        Married-spouse-absent    12.631023
        Never-married             9.717602
        Separated                10.811704
        Widowed                  14.216489
Name: age, dtype: float64

In [12]:
 df.groupby("native-country")["age"].mean()

native-country
?                             38.772462
Cambodia                      36.892857
Canada                        44.049451
China                         41.852459
Columbia                      39.458824
Cuba                          46.355072
Dominican-Republic            37.970874
Ecuador                       37.666667
El-Salvador                   33.380645
England                       40.527559
France                        40.315789
Germany                       38.601942
Greece                        45.836735
Guatemala                     32.090909
Haiti                         38.600000
Holand-Netherlands            32.000000
Honduras                      35.050000
Hong                          34.233333
Hungary                       50.368421
India                         38.364238
Iran                          38.372881
Ireland                       38.486486
Italy                         45.419048
Jamaica                       37.141509
Japan                         37.358696
Laos                          35.217391
Mexico                        33.635121
Nicaragua                     36.285714
Outlying-US(Guam-USVI-etc)    38.826087
Peru                          36.434783
Philippines                   39.633898
Poland                        42.758621
Portugal                      41.238806
Puerto-Rico                   39.864130
Scotland                      46.761905
South                         38.095652
Taiwan                        34.184615
Thailand                      37.666667
Trinadad&Tobago               39.259259
United-States                 38.698690
Vietnam                       34.616279
Yugoslavia                    40.478261
Name: age, dtype: float64

In [13]:
 df.groupby(["gender","income"])["age"].mean()

gender  income
Female  <=50K     36.278999
        >50K      42.219333
Male    <=50K     37.248548
        >50K      44.641863
Name: age, dtype: float64

In [14]:
 df.groupby(["income","gender"])["age"].mean()

income  gender
<=50K   Female    36.278999
        Male      37.248548
>50K    Female    42.219333
        Male      44.641863
Name: age, dtype: float64

In [15]:
 df.groupby("marital-status")["marital-status"].count()

marital-status
Divorced                  6633
Married-AF-spouse           37
Married-civ-spouse       22379
Married-spouse-absent      628
Never-married            16117
Separated                 1530
Widowed                   1518
Name: marital-status, dtype: int64

In [16]:
df["marital-status"].value_counts()

marital-status
Married-civ-spouse       22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: count, dtype: int64

In [17]:
df["marital-status"].count()

48842